import React, { useEffect, useState } from "react";

import Layout from "../components/base";

const Question7 = () => {
  return (
    <Layout>
      <div className="cs-container">
        <h1>سوال هفتم</h1>
        <h2>ورژن کنترل چیست توضیح دهید؟</h2>

        <h3>کد های مربوط به این سوال در فایل زیر است:</h3>
        <p
          style={{
            direction: "ltr",
            fontWeight: "bold",
            fontFamily: "Roboto",
          }}
        >
          pages/question7
        </p>

        <div
          style={{
            fontWeight: "bold",
            textAlign: "left",
            direction: "rtl",
            padding: "50px 0 20px 0",
          }}
        >
          {/* جواب خود را در اینجا بنویسید */}
          Version control به مدیریت نسخه ها می‌پردازد. در یک پروژه نرم‌افزاری،
          شاید بخشی از کار توسعه دهندگان بر روی یک قسمت از کد کار می‌کنند و بخشی
          دیگر از تیم بر روی قسمت دیگری از کد کار می‌کنند. در طول زمان ،
          نسخه‌های مختلفی از کد ایجاد می‌شود. اگر هر قسمت به صورت جداگانه باشد،
          بسیار دشوار است که تغییرات را با هماهنگی تیم‌های مختلف ادغام کنید و
          مشکلاتی که به وجود می‌آیند را رفع کنید. با استفاده از سیستم مدیریت
          نسخه (Version Control)، شما می‌توانید نسخه‌های مختلف کد خود را در یک
          محیط مجازی ذخیره کنید. بنابراین، هر کاربر می‌تواند از نسخه کد برای کار
          خود استفاده کند، تغییرات را اعمال کند و به سایر تیم‌ها اعلام کند. برای
          هماهنگی کار، مشکلات راحت‌تر شناسایی و رفع می‌شوند و همچنین امکان
          بازگشت به نسخه‌های قبلی کد را فراهم می‌کند. Git یکی از محبوبترین
          سیستم‌های مدیریت نسخه است که امروزه بسیار پرکاربرد است. با استفاده از
          Git ، تیم توسعه دهنده می‌تواند همزمان در یک پروژه کار کند، تغییرات خود
          را ذخیره کند و هماهنگی بیشتری در کار خود داشته باشد.
        </div>
      </div>
    </Layout>
  );
};

export default Question7;
